app/controllers/api/bookings_controller.rb

INSERT INTO "bookings" ("listing_id", "guest_id", "checkin_date", "checkout_date", "created_at", "updated_at", "num_guests") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    @booking.guest_id = current_user.id
    # debugger

    if @booking.save

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @booking = Booking.find(params[:id])