app/controllers/api/listings_controller.rb

INSERT INTO "listings" ("name", "host_id", "description", "price", "num_bedrooms", "max_guests", "street_address", "city", "zip_code", "created_at", "updated_at", "lat", "lng") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @listing = Listing.create!(listing_params)

SELECT "listings".* FROM "listings"
---
  def index
    @listings = Listing.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @listing = Listing.find(params[:id])